src/main/resources/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:GetListByName>
            <tem:name>Xavier</tem:name>
        </tem:GetListByName>
    </soapenv:Body>
</soapenv:Envelope>